Autodesk.Revit.DB.DirectShapeType.UpdateExternallyTaggedGeometry(Autodesk.Revit.DB.ExternallyTaggedGeometryObject)
Updates the externally tagged geometry object in the DirectShapeType.
externallyTaggedGeometry:
The externally tagged geometry that should be updated in the DirectShapeType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
A previous version of the externally tagged geometry is not present in this DirectShapeType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeType.GetExternallyTaggedGeometry(Autodesk.Revit.DB.ExternalGeometryId)
Gets the externally tagged geometry by its external ID that is stored in this DirectShapeType.
externalId:
The external ID of the externally tagged geometry that should be obtained.
Returns:
The externally tagged geometry.
Or null if there is no such an externally tagged geometry in the DirectShapeType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeType.AddExternallyTaggedGeometry(Autodesk.Revit.DB.ExternallyTaggedGeometryObject)
Adds the externally tagged geometry object to the DirectShapeType.
externallyTaggedGeometry:
The externally tagged geometry that should be added to the DirectShapeType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The externallyTaggedGeometry has already been added to this DirectShapeType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeType.AddReferencePoint(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.DirectShapeReferenceOptions)
Adds a reference point to the DirectShapeType.
refPoint:
The coordinates of the new reference point.
options:
The options that are used to configure the new reference point.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input point lies outside of Revit design limits.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeType.AddReferencePlane(Autodesk.Revit.DB.Plane,Autodesk.Revit.DB.BoundingBoxUV,Autodesk.Revit.DB.DirectShapeReferenceOptions)
Adds a reference plane to the DirectShapeType. The reference plane can either be bounded or unbounded.
refPlane:
The geometry of the new reference plane.
boundingBoxUV:
If boundingBoxUV is set, the resulting reference plane that is added to the DirectShapeType will be displayed
with those bounds. Note that the specified bounds must not be degenerate.
If boundingBoxUV is not set, reasonable bounds are automatically calculated and applied to the input plane.
The automatic bounds are based on the host direct shape's geometry.
options:
The options that are used to configure the new reference plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
boundingBoxUV cannot be used as a BoundingBoxUV for the reference plane surface.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeType.AddReferencePlane(Autodesk.Revit.DB.Plane,Autodesk.Revit.DB.DirectShapeReferenceOptions)
Adds a reference plane to the DirectShapeType. The reference plane can either be bounded or unbounded.
refPlane:
The geometry of the new reference plane.
options:
The options that are used to configure the new reference plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeType.AddReferenceCurve(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.DirectShapeReferenceOptions)
Adds a reference curve to the DirectShapeType.
refCurve:
The geometry of the new reference curve.
First case: The input curve's bounds are set. The resulting reference curve that is added to the
DirectShapeType will be displayed with those bounds. Note that the specified bounds must not be degenerate.
Second case: The input curve is unbounded. Reasonable bounds are therefore automatically calculated
and applied to the input curve. The automatic bounds are based on the host direct shape's geometry.
Note that only lines and splines may be unbounded. You must specify valid bounds for all other curve types.
options:
The options that are used to configure the new reference curve.
Throws Autodesk.Revit.Exceptions.ArgumentException:
refCurve cannot be used for creating a reference curve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022